In [1]:
import pandas as pd
import re

In [2]:
Baseball_careers = pd.read_csv("Baseball_careers.csv")

In [3]:
Baseball_careers.head()

,Unnamed: 0,AB,Age,BB,From,G,H,HR,OPS,PA,R,SB,SO,To,WAR,experience,names,Zero
0,0,2216,32.326,297,1890,607,534,14,0.669,2532,338,53,221,1900,11.5,7,Bob Allen,0
1,1,43,23.178,2,1899,16,10,0,0.608,46,5,0,5,1900,0.1,2,Harvey Bailey,0
2,2,1,24.249,0,1900,1,0,0,0.000,1,0,0,0,1900,0.0,1,Rome Chambers,0
3,3,449,33.138,22,1899,130,132,3,0.758,476,70,10,25,1900,1.2,2,Pearce Chiles,0
4,4,4295,36.070,341,1884,1160,1231,77,0.769,4721,619,55,317,1900,32.1,17,Jack Clements,0

In [27]:
Baseball_careers_5 = Baseball_careers.tail()

In [28]:
Baseball_careers_5

,Unnamed: 0,AB,Age,BB,From,G,H,HR,OPS,PA,R,SB,SO,To,WAR,experience,names,Zero
15066,15066,1109,35.094,46,2000,575,253,31,0.645,1184,149,55,245,2013,0.8,11,Dewayne Wise,0
15067,15067,1,30.330,0,2007,15,0,0,0.000,1,0,0,1,2013,0.0,3,Ross Wolf,0
15068,15068,3749,34.090,539,2004,1061,1053,150,0.861,4436,653,26,828,2013,32.7,10,Kevin Youkilis,0
15069,15069,7918,36.345,575,2000,1970,2375,185,0.787,8612,1137,90,1235,2013,24.2,14,Michael Young,0
15070,15070,0,30.231,0,2007,82,0,0,NaN,0,0,0,0,2013,0.0,5,Mike Zagurski,0

In [30]:
Baseball_careers_life = Baseball_careers_5["From"]

In [31]:
Baseball_careers_life = pd.DataFrame(Baseball_careers_life)

In [32]:
Baseball_careers_life["names"] = Baseball_careers_5["names"]
Baseball_careers_life["Year_To"] = Baseball_careers_5["To"]

In [34]:
Baseball_careers_life.columns = ["Year_From", "Names", "Year_To"]

In [36]:
Baseball_careers_life.to_csv("Baseball_careers_small.csv")

In [37]:
Baseball_careers_life

       Year_From           Names  Year_To
15066       2000    Dewayne Wise     2013
15067       2007       Ross Wolf     2013
15068       2004  Kevin Youkilis     2013
15069       2000   Michael Young     2013
15070       2007   Mike Zagurski     2013